run/randomInjectionTest/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
        value           $internalField;
    }

    outlet
    {
        type            totalPressure;
        value           $internalField;
        p0              $internalField;
    }
    
    inlet
    {
        type            zeroGradient;
        value           $internalField;

    }
    
    side
    {
        type            zeroGradient;
        value           $internalField;

    }
}


// ************************************************************************* //
