run/randomInjectionTest/constant/Samples/Sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      scalarListList;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
 column 1: scalar representing the limits of the classes for the droplets diameter [m]
 column 2: scalar representing CDF for the specific class limit in column 1
 column 3: list of scalars representing the limits of the classes for Vx associated with
           the respective diameter of column 1 [m/s]
 column 4: list of scalars representing CDF for each Vx limit from the list in column 3
 column 5: list of scalars representing the limits of the classes for Vy associated with
           the respective diameter of column 1 [m/s]
 column 6: list of scalars representing CDF for each Vy limit from the list in column 5
 column 7: list of scalars representing the limits of the classes for Vz associated with
           the respective diameter of column 1 [m/s]
 column 8: list of scalars representing CDF for each Vz limit from the list in column 7

 The files are saved with the name: Samples_x_y_z
 x, y, and z are the coordinates of the point in mm/10. For example:
 Samples_-8_40_-200 mean x = -0.8 mm, y = 4 mm, z = -20 mm
*/

// Test dCDF_vCDF
(
0.000800    0.0     (0 0.001)       (0.0 1.0)   (0 0.001)       (0.0 1.0)   (0 0.001)       (0.0 1.0)
0.000801    0.2     (0 0.001)       (0.0 1.0)   (0 0.001)       (0.0 1.0)   (-50.1 -50)     (0.0 1.0)
0.000802	0.4     (19.9 20.1)     (0.0 1.0)   (0 0.001)       (0.0 1.0)   (-50.1 -50)     (0.0 1.0)
0.000803	0.6	    (0 0.001)       (0.0 1.0)   (19.9 20.1)     (0.0 1.0)   (-50.1 -50)     (0.0 1.0)
0.000804	0.8	    (-20.1 -19.9)   (0.0 1.0)   (0 0.001)       (0.0 1.0)   (-50.1 -50)     (0.0 1.0)
0.000805	1.0	    (0 0.001)       (0.0 1.0)   (-20.1 -19.9)   (0.0 1.0)   (-50.1 -50)     (0.0 1.0)
)

// Test dCDF_vMeanStd
/*(*/
/*0.000200    0.0     (0.001) (0.001)   (0.001)   (0.001)   (0.001)     (0.001)*/
/*0.000201    0.2     (0.001) (0.001)   (0.001)   (0.001)   (-50.0)     (0.001)*/
/*0.000202	0.4     (20.0)  (0.001)   (0.001)   (0.001)   (-50.0)     (0.001)*/
/*0.000203	0.6	    (0.001) (0.001)   (20.0)    (0.001)   (-50.0)     (0.001)*/
/*0.000204	0.8	    (-20.0) (0.001)   (0.001)   (0.001)   (-50.0)     (0.001)*/
/*0.000205	1.0	    (0.001) (0.001)   (-20.0)   (0.001)   (-50.0)     (0.001)*/
/*)*/

// Test dMeanStd_vMeanStd
/*(*/
/*0.000200    0.00001     (0.0) (10.0)   (0.0)   (10.0)   (-50.0)     (0.001)*/
/*)*/

