run/randomInjectionTest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-40    -40   -20)
    ( 40    -40   -20)
    ( 40     40   -20)
    (-40     40   -20)

    (-40    -40    20)
    ( 40    -40    20)
    ( 40     40    20)
    (-40     40    20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
    side
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
